Tried updating HTTPS -> HTTP

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.ecs_fargate_service.aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-2:381492017277:service/charlotte-vpc8-civiform/charlotte-vpc8-civiform-service"
        name                               = "charlotte-vpc8-civiform-service"
        tags                               = {
            "Name" = "charlotte-vpc8-civiform-ecs-tasks-sg"
            "Type" = "Civiform Fargate Service"
        }
        # (17 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "charlotte-vpc8-civiform" -> null
          - container_port   = 9000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:381492017277:targetgroup/charlotte-vpc8-https-9000/4183cc1e34fe7388" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "charlotte-vpc8-civiform"
          + container_port   = 9000
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ecs_fargate_service.aws_lb_listener.lb_https_listeners will be updated in-place
  ~ resource "aws_lb_listener" "lb_https_listeners" {
        id                = "arn:aws:elasticloadbalancing:us-east-2:381492017277:listener/app/charlotte-vpc8-civiform-lb/b14031ebc73c49c4/5d68bbfdb4a381e3"
        tags              = {
            "Name" = "charlotte-vpc8 Civiform Fargate Service"
            "Type" = "Civiform Fargate Service"
        }
        # (7 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:381492017277:targetgroup/charlotte-vpc8-https-9000/4183cc1e34fe7388" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.ecs_fargate_service.aws_lb_target_group.lb_https_tgs must be replaced
+/- resource "aws_lb_target_group" "lb_https_tgs" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-2:381492017277:targetgroup/charlotte-vpc8-https-9000/4183cc1e34fe7388" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/charlotte-vpc8-https-9000/4183cc1e34fe7388" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-2:381492017277:targetgroup/charlotte-vpc8-https-9000/4183cc1e34fe7388" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "charlotte-vpc8-https-9000"
      + preserve_client_ip                 = (known after apply)
      ~ protocol                           = "HTTPS" -> "HTTP" # forces replacement
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Name" = "charlotte-vpc8-civiform-https-9000"
            "Type" = "Civiform Fargate Service"
        }
        # (10 unchanged attributes hidden)

      ~ health_check {
          ~ protocol            = "HTTPS" -> "HTTP"
            # (8 unchanged attributes hidden)
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      - target_failover {}
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

```
╷
│ Error: ELBv2 Target Group (charlotte-vpc8-https-9000) already exists
│ 
│   with module.ecs_fargate_service.aws_lb_target_group.lb_https_tgs,
│   on ../../modules/ecs_fargate_service/main.tf line 114, in resource "aws_lb_target_group" "lb_https_tgs":
│  114: resource "aws_lb_target_group" "lb_https_tgs" {
│ 
```